You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRemoveMembersInCircuitHavingParent { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRemoveMembersInCircuitHavingParent As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRemoveMembersInCircuitHavingParent {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace